hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    // Park fallback: some harnesses stop publishing a clean P value after the
    // car is locked/asleep and only leave SNA/invalid plus low-power hints.
    bool gearLowPower = dashSleepGearKnown &&
                        (dashSleepGear == 0 || dashSleepGear == 7 ||
                         !dashSleepSignalFresh(dashSleepGearSeenMs, kDashSleepDriveSignalFreshMs));
    bool epasLowPower = dashSleepEpasKnown &&
                        dashSleepSignalFresh(dashSleepEpasSeenMs, kDashSleepLockFallbackMs * 2) &&
                        (dashSleepEpasPowerMode == 0 || dashSleepEpasPowerMode == 6);
    bool diLowPower = dashSleepDiPowerKnown &&
                      dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepLockFallbackMs * 2) &&
                      (dashSleepDiPowerState == 0 || dashSleepDiPowerState == 4);

    return gearLowPower && (epasLowPower || diLowPower);
}

static bool dashSleepVehicleEmptyReady()
{
    if (dashSleepSeatOccupied())
        return false;
    if (dashSleepAllSeatsKnownEmpty())
        return true;
    if (dashSleepDriverKnown && dashSleepDriverPresent &&
        dashSleepSignalFresh(dashSleepDriverSeenMs, kDashSleepDriveSignalFreshMs))
        return false;
    if (dashSleepDriverKnown && !dashSleepDriverPresent)
        return true;
    if (dashSleepLockLatched &&
        dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs) &&
        !dashSleepRecentDriveEvidence())
        return true;

    // If driver-present is not visible on this harness, a quiet low-power
    // parked state is the practical empty-cabin fallback.
    return dashSleepParkStateFallbackReady() && !dashSleepRecentUnlockEvidence();
}

static bool dashSleepLowPowerLockFallbackReady()
{
    if (dashSleepRecentUnlockEvidence())
        return false;

    // Some harnesses never expose 0x273/0x339 after lock. Treat the car as
    // locked only when drive evidence is gone and low-power parked-state
    // hints remain. This is intentionally independent from cabin inference to
    // avoid deadlock when 0x3A1 driver-present is not visible on the harness.
    return dashSleepParkStateFallbackReady();
}

static bool dashSleepEffectiveLocked()
{
    return dashSleepLockLatched &&
           dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs);
}

static const char *dashSleepEffectiveLockSource()
{
    if (dashSleepLockLatched &&
        dashSleepSignalFresh(dashSleepLockLatchedMs, kDashSleepLatchedLockFreshMs))
        return dashSleepLockSource;
    return "none";
}

static bool dashSleepParkStateReady()
{
    if (dashSleepGearKnown)
    {
        if (dashSleepGear == 1)
            return true;
        // R/N/D are definitive awake/drive states. INVALID/SNA may be emitted
        // while modules are powering down, so allow the lock-state fallback.
        if ((dashSleepGear == 2 || dashSleepGear == 3 || dashSleepGear == 4) &&
            dashSleepSignalFresh(dashSleepGearSeenMs, kDashSleepDriveSignalFreshMs))
            return false;
    }

    return dashSleepParkStateFallbackReady();
}

static bool dashSleepDriverClearReady()
{
    return dashSleepVehicleEmptyReady();
}
static const char *dashSleepBlockReason()
{
    if (!dashAutoSleepEnabled)
        return "off";
    if (dashSleepActive)
        return "sleeping";
    if (Update.isRunning())
        return "ota running";
    if (!dashSleepEffectiveLocked())
        return "waiting lock 0x273/0x339";
    return "lock deep sleep ready";
}

static bool dashSleepParkLockReady()
{
    if (!dashAutoSleepEnabled || dashSleepActive || Update.isRunning())
        return false;
    if (!dashSleepEffectiveLocked())
        return false;
    return true;
}

static bool dashSleepVcsecStatusLocked(uint8_t status)
{
    return status == 2 || status == 5 || status == 8 ||
           status == 10 || status == 12 || status == 15;
}

static bool dashSleepVcsecStatusUnlocked(uint8_t status)
{
    return status == 1 || status == 3 || status == 4 ||
           status == 6 || status == 7 || status == 9 ||
           status == 11 || status == 13 || status == 14;
}

static void dashSleepRequestWake(const char *reason)
{
    if (!dashSleepActive)
        return;
    dashSleepWakeReason = reason;
    dashSleepWakeRequested = true;
}

static void dashSleepObserveFrame(const CanFrame &frame)
{
    if (dashSleepActive)
        dashSleepCurrentRxCount++;
    if (frame.dlc < 3)
        return;

    if (frame.id == 280)
    {
        uint8_t gear = readDIGear(frame);
        dashSleepGearKnown = true;
        dashSleepGear = gear;
        dashSleepGearSeenMs = millis();
        if (gear == 2 || gear == 3 || gear == 4)
        {
            dashSleepClearLockState("drive");
            dashSleepRequestWake("gear");
        }
    }
    else if (frame.id == 627)
    {
        uint8_t lockRequest = static_cast<uint8_t>(dashReadLeBits(frame, 17, 3));
        dashSleepUiLockKnown = true;
        dashSleepUiLockRequest = lockRequest;
        dashSleepUiLockSeenMs = millis();
        if (lockRequest == 1 || lockRequest == 4)
        {
            dashSleepLatchLock("0x273");
        }
        else if (lockRequest == 2 || lockRequest == 3)
        {
            dashSleepClearLockState("0x273");
            dashSleepRequestWake("unlock");
        }
    }
    else if (frame.id == 825)
    {
        uint8_t vehicleLockStatus = static_cast<uint8_t>(dashReadLeBits(frame, 12, 4));
        uint8_t simpleLockStatus = static_cast<uint8_t>(dashReadLeBits(frame, 54, 2));
        dashSleepVcsecKnown = true;
        dashSleepVcsecVehicleLockStatus = vehicleLockStatus;
        dashSleepVcsecSimpleLockStatus = simpleLockStatus;
        dashSleepVcsecSeenMs = millis();
        if (simpleLockStatus == 2 || dashSleepVcsecStatusLocked(vehicleLockStatus))
        {
            dashSleepLatchLock("0x339");
        }
        else if (simpleLockStatus == 1 || dashSleepVcsecStatusUnlocked(vehicleLockStatus))
        {
            dashSleepClearLockState("0x339");
            dashSleepRequestWake("unlock");
        }
    }
    else if (frame.id == 929 && frame.dlc >= 2)
    {
        dashSleepDriverKnown = true;
        dashSleepDriverPresent = dashReadLeBits(frame, 7, 1) != 0;
        dashSleepDriverSeenMs = millis();
        dashSleepSetSeatState(dashSleepSeatDriver,
                              dashSleepDriverPresent ? kDashSleepSeatOccupied : kDashSleepSeatEmpty);
        dashSleepSetSeatState(dashSleepSeatPassenger,
                              dashReadLeBits(frame, 8, 1) ? kDashSleepSeatOccupied : kDashSleepSeatEmpty);
        if (frame.dlc >= 6)
        {
            // 0x3A1 rear-row "unbuckled" values only prove occupancy when the
            // chime reports OCCUPIED_AND_UNBUCKLED; value 0 can also mean a
            // seated passenger is buckled, so do not use it as "empty".
            if (dashReadLeBits(frame, 36, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearLeft, kDashSleepSeatOccupied);
            if (dashReadLeBits(frame, 38, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearCenter, kDashSleepSeatOccupied);
            if (dashReadLeBits(frame, 40, 2) == 1)
                dashSleepSetSeatState(dashSleepSeatRearRight, kDashSleepSeatOccupied);
        }
        dashSleepDiPowerKnown = true;
        dashSleepDiPowerState = static_cast<uint8_t>(dashReadLeBits(frame, 10, 3));
        if (dashSleepSeatOccupied())
        {
            dashSleepClearLockState("seat");
            dashSleepRequestWake("seat");
        }
        else if (dashSleepDiPowerState == 3)
        {
            dashSleepClearLockState("driver");
            dashSleepRequestWake("driver");
        }
    }
    else if (frame.id == 962 && frame.dlc >= 8)
    {
        // 0x3C2 VCLEFT_switchStatus mux 0 carries direct seat occupancy
        // switches. On LHD Model 3/Y, front-left is the driver seat.
        if (dashReadLeBits(frame, 0, 2) == 0)
        {
            dashSleepSetSeatState(dashSleepSeatDriver,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 50, 2))));
            dashSleepSetSeatState(dashSleepSeatRearCenter,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 54, 2))));
            dashSleepSetSeatState(dashSleepSeatRearLeft,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 56, 2))));
            dashSleepSetSeatState(dashSleepSeatRearRight,
                                  dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 58, 2))));
            if (dashSleepSeatOccupied())
            {
                dashSleepClearLockState("seat");
                dashSleepRequestWake("seat");
            }
        }
    }
    else if (frame.id == 963 && frame.dlc >= 6)
    {
        // 0x3C3 VCRIGHT_switchStatus front occupancy switch supplements the
        // 0x3A1 passenger-present bit when this frame is visible on the harness.
        dashSleepSetSeatState(dashSleepSeatPassenger,
                              dashSleepSeatSwitchState(static_cast<uint8_t>(dashReadLeBits(frame, 42, 2))));
        if (dashSleepSeatOccupied())
        {
            dashSleepClearLockState("seat");
            dashSleepRequestWake("seat");
        }
    }
    else if (frame.id == 49)
    {
        dashSleepEpasKnown = true;
        dashSleepEpasPowerMode = static_cast<uint8_t>(dashReadLeBits(frame, 16, 3));
        dashSleepEpasSeenMs = millis();
        if (dashSleepEpasPowerMode == 1 || dashSleepEpasPowerMode == 2)
        {
            dashSleepClearLockState("epas");
            dashSleepRequestWake("epas");
        }
    }
}

static void dashCollectPostIntents(CarManagerBase &handler, const CanFrame &original, FrameCoordinator &plan)
{
    dashSleepObserveFrame(original);
    if (dashSleepActive) return;
    collectFsdCompatibility(handler, plan,
        canActive && (!apInjectionGate || handler.injectionGateOpen()));
}
static bool dashQueuedRequestAllowed(const TxRequest &request)
{
    if (!canActive || dashSleepActive || appTxPaused) return false;
    if (request.hasOwner(FeatureId::Fsd) && request.protocol() != FrameProtocol::HW4)
        return !apInjectionGate || (dashHandler && dashHandler->injectionGateOpen());
    return true;
}
static bool dashCheckNagDisabled()
{
    return false;
}

static bool dashStaSsidLooksCorrupt(const String &ssid)
{
    return ssid.indexOf("\"ssid\"") >= 0 || ssid.indexOf("{\"") >= 0 ||
           ssid.indexOf("\",\"") >= 0;
}

// dashClampHw3SlewRate / dashLoadHw3SlewRate now in dash_hw3_speed.h.

static uint8_t dashClampSpeedProfileForHw(uint8_t hw, int profile)
{
    int maxProfile = hw == 2 ? 4 : 2;
    if (profile < 0)
        return 0;
    if (profile > maxProfile)
        return static_cast<uint8_t>(maxProfile);
    return static_cast<uint8_t>(profile);
}

static void dashApplySpeedProfileState()
{
    if (!dashHandler)
        return;
    dashHandler->speedProfileAuto = dashSpeedProfileAuto;
    if (!dashSpeedProfileAuto)
        dashHandler->speedProfile = dashClampSpeedProfileForHw(hwMode, dashManualSpeedProfile);
}

// HW3 mux-2 codec + slew limiter live in include/dash_hw3_speed.h so they
// can be shared between HW3Handler (in handlers.h, parsed first) and the
// dashboard HW3 send path below.

static void dashApplyRuntimeState()
{
    forceActivateRuntime = canActive && forceActivate;
    emergencyVehicleDetectionRuntime = false;
    isaSpeedChimeSuppressRuntime = false;
    enhancedAutopilotRuntime = false;
    nagKillerRuntime = false;

    if (dashHandler)
    {
        dashHandler->checkAD = dashCheckADEnabled;
        dashHandler->checkNag = dashCheckNagDisabled;
        dashApplySpeedProfileState();
        if (!canActive)
        {
            dashHandler->ADEnabled = false;
            dashHandler->APActive = false;
        }
    }

#if defined(DASH_RGB_STATUS_LED)
    appRefreshStatusLed();
#endif
}

