hqs17017301634-max/ESP-IDF_waveshare_ESP32_S3_RS485_CAN/include/web/mcp2515_dashboard.h
    bool APActive = dashHandler ? (bool)dashHandler->APActive : false;
    bool ADEnabled = dashHandler ? (bool)dashHandler->ADEnabled : false;
    int sp = dashHandler ? (int)dashHandler->speedProfile : 0;
    bool spAuto = dashHandler ? (bool)dashHandler->speedProfileAuto : true;
    int soff = dashHandler ? (int)dashHandler->speedOffset : 0;
    int gtwAp = dashHandler && !dashCanPriorityFilterActive ? (int)dashHandler->gatewayAutopilot : -1;
    bool ep = dashHandler ? (bool)dashHandler->enablePrint : true;
    bool apGateOpen = dashApInjectionAllowed();

    String j = "{\"hw\":";
    j += hwMode;
    j += ",\"sp\":";
    j += sp;
    j += ",\"spAuto\":";
    j += spAuto ? "true" : "false";
    j += ",\"soff\":";
    j += soff;
    j += ",\"gtwap\":";
    j += gtwAp;
    j += ",\"AD\":";
    j += APActive ? "true" : "false";
    j += ",\"apActive\":";
    j += APActive ? "true" : "false";
    j += ",\"adEnabled\":";
    j += ADEnabled ? "true" : "false";
    j += ",\"eprn\":";
    j += ep ? "true" : "false";
    j += ",\"force\":";
    j += forceActivate ? "true" : "false";
    j += ",\"apGate\":";
    j += (canActive && !apGateOpen) ? "true" : "false";
    j += ",\"apGateOpen\":";
    j += apGateOpen ? "true" : "false";
    j += ",\"apGateEnabled\":";
    j += apInjectionGate ? "true" : "false";
    j += ",\"autoSleep\":";
    j += dashAutoSleepEnabled ? "true" : "false";
    j += ",\"canprio\":";
    j += dashCanPriorityMode ? "true" : "false";
    j += ",\"gtw_status_filtered\":" + String(dashCanPriorityFilterActive ? "true" : "false");
    j += ",\"canprioActive\":";
    j += dashCanPriorityFilterActive ? "true" : "false";
    if (dashDriver)
    {
        CanDriver::Diagnostics d = dashDriver->diagnostics();
        j += ",\"canDiag\":{\"rxQFull\":" + String(d.rxQueueFull) +
             ",\"rxOvr\":" + String(d.rxFifoOverrun) +
             ",\"txFail\":" + String(d.txFailed) +
             ",\"txRetry\":" + String(d.txRetry) +
             ",\"busOff\":" + String(d.busOff) +
             ",\"recCnt\":" + String(d.recoverCount) +
             ",\"swFlt\":" + String(d.softwareFiltered) +
             ",\"lastGapUs\":" + String(d.lastLoopGapUs) +
             ",\"maxGapUs\":" + String(d.maxLoopGapUs) +
             ",\"hwAcc\":" + String(d.hardwareAcceptedIds) +
             ",\"exFlt\":" + String(d.exactFilterCount) + "}";
    }
    j += ",\"sleepActive\":";
    j += dashSleepActive ? "true" : "false";
    j += ",\"sleepState\":\"";
    j += dashSleepStateText();
    j += "\",\"sleepReason\":\"";
    j += jsonEscape(dashSleepBlockReason());
    j += "\",\"sleepReady\":";
    j += dashSleepParkLockReady() ? "true" : "false";
    j += ",\"sleepGear\":";
    j += dashSleepGearKnown ? String(dashSleepGear) : String(-1);
    j += ",\"sleepGearAge\":";
    j += dashSleepSignalAgeSec(dashSleepGearSeenMs);
    j += ",\"sleepParkState\":";
    j += dashSleepParkStateReady() ? "true" : "false";
    j += ",\"sleepVehicleEmpty\":";
    j += dashSleepVehicleEmptyReady() ? "true" : "false";
    j += ",\"sleepLocked\":";
    j += dashSleepEffectiveLocked() ? "true" : "false";
    j += ",\"sleepLockFallback\":";
    j += dashSleepLowPowerLockFallbackReady() ? "true" : "false";
    j += ",\"sleepLockSource\":\"";
    j += dashSleepEffectiveLockSource();
    j += "\",\"sleepLockAge\":";
    j += dashSleepSignalAgeSec(dashSleepLockLatchedMs);
    j += ",\"sleepUiLockReq\":";
    j += dashSleepUiLockKnown ? String(dashSleepUiLockRequest) : String(-1);
    j += ",\"sleepUiLockAge\":";
    j += dashSleepSignalAgeSec(dashSleepUiLockSeenMs);
    j += ",\"sleepVcsecLock\":";
    j += dashSleepVcsecKnown ? String(dashSleepVcsecVehicleLockStatus) : String(-1);
    j += ",\"sleepVcsecSimple\":";
    j += dashSleepVcsecKnown ? String(dashSleepVcsecSimpleLockStatus) : String(-1);
    j += ",\"sleepVcsecAge\":";
    j += dashSleepSignalAgeSec(dashSleepVcsecSeenMs);
    j += ",\"sleepDriverPresent\":";
    j += dashSleepDriverKnown ? (dashSleepDriverPresent ? "true" : "false") : "null";
    j += ",\"sleepDriverAge\":";
    j += dashSleepSignalAgeSec(dashSleepDriverSeenMs);
    j += ",\"sleepSeatKnown\":";
    j += dashSleepSeatKnown() ? "true" : "false";
    j += ",\"sleepSeatOccupied\":";
    j += dashSleepSeatOccupied() ? "true" : "false";
    j += ",\"sleepSeatAge\":";
    j += dashSleepSignalAgeSec(dashSleepSeatSeenMs);
    j += ",\"sleepSeatDriver\":";
    j += String(dashSleepSeatDriver);
    j += ",\"sleepSeatPassenger\":";
    j += String(dashSleepSeatPassenger);
    j += ",\"sleepSeatRearLeft\":";
    j += String(dashSleepSeatRearLeft);
    j += ",\"sleepSeatRearCenter\":";
    j += String(dashSleepSeatRearCenter);
    j += ",\"sleepSeatRearRight\":";
    j += String(dashSleepSeatRearRight);
    j += ",\"sleepDiPower\":";
    j += dashSleepDiPowerKnown ? String(dashSleepDiPowerState) : String(-1);
    j += ",\"sleepEpasPower\":";
    j += dashSleepEpasKnown ? String(dashSleepEpasPowerMode) : String(-1);
    j += ",\"sleepEpasAge\":";
    j += dashSleepSignalAgeSec(dashSleepEpasSeenMs);
    j += ",\"sleepCountdownMs\":";
    if (dashSleepCandidateSinceMs)
    {
        unsigned long elapsed = millis() - dashSleepCandidateSinceMs;
        j += elapsed >= kDashAutoSleepDelayMs ? 0 : (kDashAutoSleepDelayMs - elapsed);
    }
    else
    {
        j += -1;
    }
    j += ",\"sleepCount\":";
    j += dashSleepEnterCount;
    j += ",\"sleepBootCount\":";
    j += dashSleepPersistBootCount;
    j += ",\"sleepTotalCount\":";
    j += dashSleepPersistTotalCount;
    j += ",\"sleepCanWakeCount\":";
    j += dashSleepPersistCanWakeCount;
    j += ",\"sleepRebootWakeCount\":";
    j += dashSleepPersistRebootWakeCount;
    j += ",\"sleepCurrentRxCount\":";
    j += dashSleepCurrentRxCount;
    j += ",\"sleepLastRxCount\":";
    j += dashSleepLastRxCount;
    j += ",\"sleepLastEnterUptime\":";
    j += dashSleepLastEnterUptimeSec;
    j += ",\"sleepLastWakeUptime\":";
    j += dashSleepLastWakeUptimeSec;
    j += ",\"sleepLastDurationSec\":";
    j += dashSleepLastDurationSec == kDashSleepDurationUnknown ? String(-1) : String(dashSleepLastDurationSec);
    j += ",\"sleepLastWakeSource\":\"";
    j += jsonEscape(dashSleepLastWakeSource);
    j += "\",\"sleepLastWakeReason\":\"";
    j += jsonEscape(dashSleepLastWakeReason);
    j += "\",\"sleepLastReset\":\"";
    j += jsonEscape(dashSleepLastResetReason);
    j += "\",\"sleepLastEndedByReboot\":";
    j += dashSleepLastEndedByReboot ? "true" : "false";
    j += ",\"ia\":";
    j += dashInjectionActive() ? "true" : "false";
    j += ",\"lastInjectMs\":";
    j += (uint32_t)lastInjectMs;
    j += ",\"hw3OffsetSlew\":";
    j += hw3OffsetSlew ? "true" : "false";
    j += ",\"hw3SlewRate\":";
    j += hw3SlewRate;
    j += ",\"hw3OffsetTarget\":";
    j += hw3OffsetTargetRaw;
    j += ",\"hw3OffsetLast\":";
    j += hw3OffsetLastRaw;
    j += ",\"hw3OffsetQueueKnown\":";
    j += hw3OffsetHasQueued ? "true" : "false";
    j += ",\"hw3OffsetQueuedAtMs\":";
    j += hw3OffsetLastQueuedMs;
    j += ",\"hw3SlewCount\":";
    j += hw3OffsetSlewCount;
    // HW3 custom speed-limit boost
    j += ",\"hw3CustomSpeed\":";
    j += hw3CustomSpeed ? "true" : "false";
    j += ",\"hw3CustomTarget\":[";
    for (uint8_t i = 0; i < kHw3CustomTargetCount; i++)
    {
        if (i) j += ",";
        j += hw3CustomTarget[i];
    }
    j += "],\"hw3HighSpeedEnable\":";
    j += hw3HighSpeedEnable ? "true" : "false";
    j += ",\"hw3HighSpeedTarget\":[";
    for (uint8_t i = 0; i < kHw3HighSpeedBucketCount; i++)
    {
        if (i) j += ",";
        j += hw3HighSpeedTarget[i];
    }
    j += "],\"hw3WireEncoding\":";
    j += hw3WireEncoding;
    j += ",\"fusedSpeedLimitRaw\":";
    j += fusedSpeedLimitRaw;
    j += ",\"fusedSpeedLimitKph\":";
    j += (fusedSpeedLimitRaw == 0 || fusedSpeedLimitRaw == 31)
             ? 0
             : (uint16_t)fusedSpeedLimitRaw * 5;
    j += ",\"hw3StockOffset\":";
    j += hw3StockOffsetKph;
    // Legacy MPP custom speed-limit override
    j += ",\"legacyMppOverride\":";
    j += legacyMppOverride ? "true" : "false";
    j += ",\"legacyMppCustomEnable\":";
    j += legacyMppCustomEnable ? "true" : "false";
    j += ",\"legacyMppCustomTarget\":[";
    for (uint8_t i = 0; i < kLegacyMppCustomTargetCount; i++)
    {
        if (i) j += ",";
        j += legacyMppCustomTarget[i];
    }
    j += "],\"legacyMppHighSpeedEnable\":";
    j += legacyMppHighSpeedEnable ? "true" : "false";
    j += ",\"legacyMppHighSpeedTarget\":[";
    for (uint8_t i = 0; i < kLegacyMppHighSpeedBucketCount; i++)
    {
        if (i) j += ",";
        j += legacyMppHighSpeedTarget[i];
    }
    j += "],\"legacyMppLastRaw\":";
    j += legacyMppLastRaw;
    j += ",\"legacyMppLastSentRaw\":";
    j += legacyMppLastSentRaw;
    j += ",\"can\":";
    j += canOnline ? "true" : "false";
    j += ",\"ci\":";
    j += canActive ? "true" : "false";
    j += ",\"rx\":";
    j += rxCount;
    j += ",\"tx\":";
    j += txCount;
    j += ",\"txerr\":";
    j += txErrCount;
    j += ",\"txSemantics\":\"driver_accepted\",\"perFrameTxDoneKnown\":false";
    j += ",\"tx_scheduler\":{\"policy\":\"fsd_first\",\"capacity\":16,\"high_reserved\":8,\"driver_tx_queue\":0,\"rx_queue\":64,\"max_dequeue_age_ms\":20";
    j += ",\"config_epoch\":" + String(static_cast<uint32_t>(appConfigEpoch));
    j += ",\"controller_epoch\":" + String(dashDriver ? dashDriver->controllerEpoch() : 0);
    j += ",\"paused\":" + String(appTxPaused ? "true" : "false");
    j += ",\"busy\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.busy));
    j += ",\"expired\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.expired));
    j += ",\"stale\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.stale));
    j += ",\"full\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.full));
    j += ",\"canceled\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.canceled));
    j += ",\"exhausted\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.exhausted));
    j += ",\"highAccepted\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.highAccepted));
    j += ",\"normalAccepted\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.normalAccepted));
    j += ",\"pending\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.pending));
    j += ",\"pendingHigh\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.pendingHigh));
    j += ",\"maxWaitMs\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.maxWaitMs));
    j += ",\"highMaxWaitMs\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.highMaxWaitMs));
    j += ",\"gateRejected\":" + String(static_cast<uint32_t>(appTxBroker.diagnostics.gateRejected));
    j += ",\"quiesce_unknown\":" + String(dashDriver ? dashDriver->diagnostics().quiesceUnknown : 0);
    j += "}";
    j += ",\"coordinator\":{\"composed\":";
    j += (uint32_t)appTxBroker.diagnostics.composed;
    j += ",\"accepted\":";
    j += (uint32_t)appTxBroker.diagnostics.accepted;
    j += ",\"rejected\":";
    j += (uint32_t)appTxBroker.diagnostics.rejected;
    j += ",\"duplicate\":";
    j += (uint32_t)appTxBroker.diagnostics.duplicate;
    j += ",\"noIntent\":";
    j += (uint32_t)appTxBroker.diagnostics.noIntent;
    j += ",\"noChange\":";
    j += (uint32_t)appTxBroker.diagnostics.noChange;
    j += ",\"invalid\":";
    j += (uint32_t)appTxBroker.diagnostics.invalid;
    j += ",\"conflict\":";
    j += (uint32_t)appTxBroker.diagnostics.conflict;
    j += ",\"timeBasis\":\"software_dequeue\"}";
    j += ",\"fd\":";
    j += followDist;
    j += ",\"fps\":";
    {
        unsigned long fpsX10 = static_cast<unsigned long>(fps * 10.0f + 0.5f);
        j += String(fpsX10 / 10);
        j += ".";
        j += String(fpsX10 % 10);
    }
    j += ",\"eflg\":";
    j += mcpEflg;
    j += ",\"up\":";
    j += (millis() - startMs) / 1000;
    j += ",\"probe\":{\"active\":";
    j += dashWriteProbe.active ? "true" : "false";
    j += ",\"state\":";
    j += dashWriteProbe.state;
    j += ",\"id\":";
    j += dashWriteProbe.id;
    j += ",\"mux\":";
    j += dashWriteProbe.mux;
    j += ",\"txa\":";
    j += dashWriteProbe.active ? String(now - dashWriteProbe.txMs) : String(0);
    j += ",\"rxa\":";
    j += dashWriteProbe.hasRx ? String(now - dashWriteProbe.rxMs) : String(0);
    j += ",\"txdlc\":";
    j += dashWriteProbe.txDlc;
    j += ",\"rxdlc\":";
    j += dashWriteProbe.rxDlc;
    j += ",\"hasrx\":";
    j += dashWriteProbe.hasRx ? "true" : "false";
    j += ",\"tx\":[";
    for (uint8_t i = 0; i < dashWriteProbe.txDlc; i++)
    {
        if (i)
            j += ",";
        j += String(dashWriteProbe.txData[i]);
    }
    j += "],\"rx\":[";
    for (uint8_t i = 0; i < dashWriteProbe.rxDlc; i++)
    {
        if (i)
            j += ",";
        j += String(dashWriteProbe.rxData[i]);
    }
    j += "]},\"mux\":[";
    for (int i = 0; i < 3; i++)
    {
        if (i)
            j += ",";
        j += "{\"rx\":" + String(muxRx[i]) +
             ",\"tx\":" + String(muxTx[i]) +
             ",\"err\":" + String(muxErr[i]) + "}";
    }
    j += "]}";
    server.send(200, "application/json", j);
}

